app/Controllers/Auth.php

SELECT *
FROM `users`
WHERE `email` = 'stoppu26@gmail.com'
 LIMIT 1
---
    public function processLogin()
    {
        $email    = trim($this->request->getPost('email'));
        $password = $this->request->getPost('password');

        $userModel = new UserModel();
        $user = $userModel->where('email', $email)->first();