app/Controllers/CoursesPage.php

SELECT *
FROM `courses`
WHERE `title` LIKE '%fisika%' ESCAPE '!'
 LIMIT 8
---
    public function index()
    {
        $model = new CourseModel();

        $category = $this->request->getGet('category');
        $q        = $this->request->getGet('q');

        if ($category && in_array($category, ['produktif','adaptif','normatif'])) {
            $model->where('category', $category);
        }

        if ($q) {
            $model->like('title', $q);
        }

        $courses = $model->paginate(8, 'courses');