app/Controllers/CoursesPage.php

SELECT COUNT(*) AS `numrows`
FROM `courses`
WHERE `title` LIKE '%web%' ESCAPE '!'
SELECT *
FROM `courses`
WHERE `title` LIKE '%web%' ESCAPE '!'
 LIMIT 12
---
    public function index()
    {
        $model = new \App\Models\CourseModel();

        $category = $this->request->getGet('category');
        $q        = $this->request->getGet('q');

        if ($category) {
            $model->where('category', $category);
        }

        if ($q) {
            $model->like('title', $q);
        }

        // ambil total (tanpa reset query)
        $total = $model->countAllResults(false);

        $courses = $model->paginate(12, 'courses');

SELECT *
FROM `courses`
WHERE `courses`.`id_course` = '4'
SELECT *
FROM `materials`
WHERE `id_course` = '4'
---
    public function detail($id)
    {
        $courseModel = new CourseModel();
        $materialModel = new MaterialModel();

        $course = $courseModel->find($id);

        if (!$course) {
            throw new \CodeIgniter\Exceptions\PageNotFoundException('Mata pelajaran tidak ditemukan');
        }

        $materials = $materialModel
            ->where('id_course', $id)
            ->findAll();