app/Controllers/GuruController.php

    public function dashboard()
    {
        $courseModel = new CourseModel();

        $courses = $courseModel
            ->where('created_by', session()->get('user_id'))
            ->findAll();
---
SELECT *
FROM `courses`
WHERE `created_by` = '7'

    public function create()
    {
        $courseModel = new CourseModel();

        $courses = $courseModel
            ->where('created_by', session()->get('user_id'))
            ->findAll();
---
SELECT *
FROM `courses`
WHERE `created_by` = '7'

    public function courses()
    {
        $model = new CourseModel();
        $q = $this->request->getGet('q');

        $model->where('created_by', session()->get('user_id'));

        if ($q) {
            $model->like('title', $q);
        }

        $courses = $model->findAll();
---
SELECT *
FROM `courses`
WHERE `created_by` = '7'