app/Controllers/Home.php

SELECT *
FROM `courses`
ORDER BY `id_course` DESC
 LIMIT 4
---
    public function index()
    {
        $model = new \App\Models\CourseModel();

        $courses = $model
            ->orderBy('id_course', 'DESC')
            ->findAll(4);